// import {FarsVillagesData} from '../data/farsVillages';
// import {Injectable} from '@angular/core';

// @Injectable()
// export class FarsVillagesService extends FarsVillagesData {
//   data = [
//     {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     }, {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     }, {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     }, {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     }, {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     }, {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     }, {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     }, {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     }, {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     }, {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     }, {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     }, {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     }, {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     }, {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     }, {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     }, {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     }, {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     }, {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     }, {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     }, {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     }, {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     }, {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     }, {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     }, {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     }, {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     }, {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     }, {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     }, {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     }, {
//       villages: [
//         {
//           id: 1,
//           name: 'آب انار',
//         }, {
//           id: 2,
//           name: 'آب زنگی',
//         }, {
//           id: 3,
//           name: 'آبادخوره',
//         }, {
//           id: 4,
//           name: 'آب پرده',
//         },
//       ],
//     },
//   ];

//   getData(id: number) {
//     return this.data[id - 1].villages;
//   }
// }
